using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Memo
{

    /*
    TODO : 게임씬 나눠주기
    TODO : 광역기 어떻게 할지 고민
    TODO : 스킬 사용시 무적되게 만들지 말지 => 무적 되게 하는게 맞는듯
    TODO : 게임씬 -> 보스씬으로 넘어가는순간에 던전에 들어가면 어떻게할지? => 일단 취소토큰으로 만들어놓긴 했는데 테스트 해봐야 할것같음
    던전 결과 팝업만들기 => 완료
    던전 시간체크해서 탈락 확인 => while문 끝나면 넣게 만듬
    몬스터가 왜 계속 생성되는가? => Boss로 바꿔줘야하는데 Play로 바꿔서그랬던거
    클리어하면 보상 어떻게 받을지 => 다이아 = 레벨 * 50 , 골드 = Money에 (레벨 *5) * 10 값 => 이렇게 했음 일단
    던전 입장재료 입장시 or 클리어시 차감시키기. => 완료
    던전 입장재료 없을시 Toast띄우기, 버튼에 text 빨간색으로 만들기 => 완료 
    TODO : 던전팝업에 남은 시간 체크하기 => 완료
    난이도 선택버튼 활성화(Toast) => 완료
    TODO : 렌더 카메라 되어있는것들 꾸며주기(다 하고 꾸미자)
    UI_HeroStatPopup 완성하기
    TODO : 던전 결과창 수정하기()
    제련 마무리하기 => 1~5개 나올 확률 지정해놓고, 50, 25, 15, 9, 1 해놓고 가져오게 만들기(글자 색으로 grade판별)
    TODO : 광고 제거시 상점 해당 버튼 비활성화 시키기
    TODO : 버프 활성화시 적용 안되는거같음
    TODO : 버튼클릭, 카메라 떨리는거 고민해보자
    TODO : 아이템 , 이름 등등도 Localization해주자( 시트 하나 더 만들어서 하는게 나을수도있을듯)
    TODO : 데일리미션 어떻게 저장할지 생각해보기
    TODO : 업적도 저장해야됨
    TODO : 업적, 미션 옆에 스크롤 달기
    TODO : 업적 스탯들 적용 되는지 확인
    */
}
